set_max_area 0
set_load 10 [all_outputs]
set_input_transition 0.5 [all_inputs]